Revit 2027 API
NavisworksExportOptions.ExportLinks Property
 True to export Revit links found in the main model, false to skip links. Default value is false.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportLinks { get; set; }
Public Property ExportLinks As Boolean
	Get
	Set
public:
property bool ExportLinks {
	bool get ();
	void set (bool value);
}
member ExportLinks : bool with get, set
Property Value
Boolean
See Also
Reference
NavisworksExportOptions Class
Autodesk.Revit.DB Namespace